w4d2/NinetyNineCats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @rental = CatRentalRequest.new
    @cats = Cat.all

SELECT "cats".* FROM "cats"
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cat_id", 2], ["start_date", "2016-05-02"], ["end_date", "2016-05-04"], ["created_at", "2016-05-31 21:43:58.592699"], ["updated_at", "2016-05-31 21:43:58.592699"]]
---
  def create
    @rental = CatRentalRequest.new(rental_params)
    @cats = Cat.all
    cat = Cat.find(rental_params[:cat_id])
    if @rental.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = ? LIMIT 1  [["id", 2]]
---
  def approve
    @rental = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = ? LIMIT 1  [["id", 2]]
---
  def deny
    @rental = CatRentalRequest.find(params[:id])