w4d2/NinetyNineCats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "name", "color", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cats" SET "birth_date" = ?, "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["birth_date", "2016-05-18"], ["description", "now hes a cat"], ["updated_at", "2016-05-31 19:16:14.910663"], ["id", 4]]
---
  def update
    @cat = Cat.find(params[:id])
    @cat.update_attributes(cat_params)