w4d2/NinetyNineCats/app/views/cats/show.html.erb

<ul>
  <% @cat.cat_rental_requests.sort_by { |el| el.start_date }.each do |request| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ?  [["cat_id", 2]]