w4d3/NinetyNineCats_II/app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    @rental_request.requester = current_user
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["created_at", "2016-06-01 21:50:22.373591"], ["end_date", "2016-06-11"], ["start_date", "2016-06-05"], ["status", "PENDING"], ["updated_at", "2016-06-01 21:50:22.373591"]]