w4d3/NinetyNineCats_II/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    @cat.owner = current_user
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = 1  [["description", "what a cute cat!!"], ["updated_at", "2016-06-01 21:46:21.260565"]]