w4d3/NinetyNineCats_II/app/controllers/sessions_controller.rb

DELETE FROM "session_lists" WHERE "session_lists"."id" = $1  [["id", 4]]
---
  def destroy
    if current_user
      fail
      current_user.session_lists.delete_session_token(session[:session_token])