w4d3/NinetyNineCats_II/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "user_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-06-01 19:14:59.681538"], ["password_digest", "$2a$10$6zAao302skfbjKUwGAHdluZbP2EBlSvSSmMQH34KgqJQbInRKOoKq"], ["updated_at", "2016-06-01 19:14:59.681538"], ["user_name", "aa"]]
---
  def create
    @user = User.new(user_params)
    if @user.save